### Imports

In [1]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

# Extract

---

### Store NYT CSV into DataFrame

In [2]:
# Store CSV into DataFrame
csv_file ="./Resources/nytbooks_data.csv"
nytbooks_data_df = pd.read_csv(csv_file)
nytbooks_data_df.head()

,publisher,title,author,primary_isbn10,weeks_on_list
0,Sapphire Star Publishing,LOST TO YOU,A L Jackson,1938404505,0
1,Random House,CONVICTION,Aaron Allston,345509102,1
2,Abbi Glines,FOREVER TOO FAR,Abbi Glines,988301334,2
3,Atria,RUSH TOO FAR,Abbi Glines,1476775958,1
4,Atria,SIMPLE PERFECTION,Abbi Glines,1476756538,1

In [3]:
# Getting summary of initial dataframe
nytbooks_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1316 entries, 0 to 1315
Data columns (total 5 columns):
publisher         1316 non-null object
title             1316 non-null object
author            1316 non-null object
primary_isbn10    1316 non-null object
weeks_on_list     1316 non-null int64
dtypes: int64(1), object(4)
memory usage: 51.5+ KB

In [4]:
# Checking max title length (just for setting up table schema varchar(?))
x=[]
for i in nytbooks_data_df.title:
    x.append(len(i))
max(x)

52

### Store GoodReads CSV into DataFrame

In [5]:
#Store second data into a DataFrame
csv_file = "./Resources/goodreads_data.csv"
goodreads_data_df = pd.read_csv(csv_file)
goodreads_data_df.head()

,bookID,title,authors,average_rating,primary_isbn10,# num_pages,ratings_count,text_reviews_count,Unnamed: 8
0,1,Harry Potter and the Half-Blood Prince (Harry ...,J.K. Rowling-Mary GrandPr√©,4.56,439785960,652,1944099,26249,NaN
1,2,Harry Potter and the Order of the Phoenix (Har...,J.K. Rowling-Mary GrandPr√©,4.49,439358078,870,1996446,27613,NaN
2,3,Harry Potter and the Sorcerer's Stone (Harry P...,J.K. Rowling-Mary GrandPr√©,4.47,439554934,320,5629932,70390,NaN
3,4,Harry Potter and the Chamber of Secrets (Harry...,J.K. Rowling,4.41,439554896,352,6267,272,NaN
4,5,Harry Potter and the Prisoner of Azkaban (Harr...,J.K. Rowling-Mary GrandPr√©,4.55,043965548X,435,2149872,33964,NaN

In [6]:
# Getting summary of initial dataframe
goodreads_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13719 entries, 0 to 13718
Data columns (total 9 columns):
bookID                13719 non-null int64
title                 13719 non-null object
authors               13719 non-null object
average_rating        13719 non-null object
primary_isbn10        13719 non-null object
# num_pages           13719 non-null object
ratings_count         13719 non-null int64
text_reviews_count    13719 non-null int64
Unnamed: 8            5 non-null float64
dtypes: float64(1), int64(3), object(5)
memory usage: 964.7+ KB

In [7]:
# Checking max title and author lengths (just for setting up table schema varchar(?))
x=[]
for i in goodreads_data_df.authors:
    x.append(len(i))
max(x)

772

# Transform

---

### Create new NYT dataframe with select columns

In [8]:
# all columns could be useful
new_nytbooks_data_df = nytbooks_data_df.copy()
new_nytbooks_data_df.head()

,publisher,title,author,primary_isbn10,weeks_on_list
0,Sapphire Star Publishing,LOST TO YOU,A L Jackson,1938404505,0
1,Random House,CONVICTION,Aaron Allston,345509102,1
2,Abbi Glines,FOREVER TOO FAR,Abbi Glines,988301334,2
3,Atria,RUSH TOO FAR,Abbi Glines,1476775958,1
4,Atria,SIMPLE PERFECTION,Abbi Glines,1476756538,1

### Create new goodreads dataframe with select columns

In [9]:
#issues loading to sql, types are wrong, certain columns are offset
# which created this "Unnamed: 8" column
goodreads_data_df[goodreads_data_df["Unnamed: 8"].notnull()]

,bookID,title,authors,average_rating,primary_isbn10,# num_pages,ratings_count,text_reviews_count,Unnamed: 8
4010,12224,Streetcar Suburbs: The Process of Growth in Bo...,Sam Bass Warner,Jr.-Sam B. Warner,3.57,en-US,236,55,6.0
5686,16914,The Tolkien Fan's Medieval Reader,David E. Smith (Turgon of TheOneRing.net,one of the founding members of this Tolkien w...,3.6,eng,400,25,4.0
7054,22128,Patriots (The Coming Collapse),James Wesley,Rawles,3.63,eng,342,38,4.0
10599,34523,The Flying Sorcerers: More Comic Tales of Fantasy,Peter Haining-Roald Dahl-Terry Pratchett-Angel...,Jr.-C.S. Lewis-P.G. Wodehouse-Michael Moorcoc...,3.98,eng,383,2197,17.0
10666,34889,Brown's Star Atlas: Showing All The Bright Sta...,Brown,Son & Ferguson,0,eng,49,0,0.0

In [10]:
# not sure how to fix reading of csv, so will just delete these columns for now
# ...there are only 5

goodreads_data_df = goodreads_data_df[~pd.notnull(goodreads_data_df["Unnamed: 8"])]

# Clean DataFrame further, selecting columns
new_goodreads_data_df = goodreads_data_df[["title", "authors", "average_rating", "ratings_count", "primary_isbn10"]].copy()
new_goodreads_data_df.head()

,title,authors,average_rating,ratings_count,primary_isbn10
0,Harry Potter and the Half-Blood Prince (Harry ...,J.K. Rowling-Mary GrandPr√©,4.56,1944099,439785960
1,Harry Potter and the Order of the Phoenix (Har...,J.K. Rowling-Mary GrandPr√©,4.49,1996446,439358078
2,Harry Potter and the Sorcerer's Stone (Harry P...,J.K. Rowling-Mary GrandPr√©,4.47,5629932,439554934
3,Harry Potter and the Chamber of Secrets (Harry...,J.K. Rowling,4.41,6267,439554896
4,Harry Potter and the Prisoner of Azkaban (Harr...,J.K. Rowling-Mary GrandPr√©,4.55,2149872,043965548X

In [11]:
#double check new good reads 
new_goodreads_data_df.info()
# looks good, 5 rows were dropped as expected

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13714 entries, 0 to 13718
Data columns (total 5 columns):
title             13714 non-null object
authors           13714 non-null object
average_rating    13714 non-null object
ratings_count     13714 non-null int64
primary_isbn10    13714 non-null object
dtypes: int64(1), object(4)
memory usage: 642.8+ KB

### Additional issues/transformation

In [12]:
# wanted to use isbn10 as a relationship key between the two tables
# but psycopg2 was having key constraint errors and failing to upload the data to the local DB
# A pandas merge shows there are actually no matching isbn's between the two dataframes
mergedCheck = pd.merge(new_goodreads_data_df, new_nytbooks_data_df, on=['primary_isbn10'], how='inner')
mergedCheck.head()
# primary / foreign key constraint will be removed in postgres

Empty DataFrame
Columns: [title_x, authors, average_rating, ratings_count, primary_isbn10, publisher, title_y, author, weeks_on_list]
Index: []

In [13]:
# Checking merge by title...isbn's could be different if the publishers are different
new_goodreads_data_df['title'] = new_goodreads_data_df['title'].str.lower()
new_nytbooks_data_df['title'] = new_nytbooks_data_df['title'].str.lower()
mergedCheck = pd.merge(new_goodreads_data_df, new_nytbooks_data_df, on=['title'], how='inner')
mergedCheck.head()

,title,authors,average_rating,ratings_count,primary_isbn10_x,publisher,author,primary_isbn10_y,weeks_on_list
0,the alchemist,Paulo Coelho-Alan R. Clarke-James Noel Smith,3.85,814,60887966,HarperCollins,Paulo Coelho,62416219,6
1,the alchemist,Paulo Coelho-Alan R. Clarke-√ñzdemir ƒ∞nce,3.85,1592632,61122416,HarperCollins,Paulo Coelho,62416219,6
2,life of pi,Yann Martel,3.9,4242,156030209,Houghton Mifflin Harcourt,Yann Martel,547416113,12
3,first love,Ivan Turgenev-Constance Garnett,3.79,5551,974607894,"Little, Brown",James Patterson and Emily Raymond,316207020,0
4,a prayer for owen meany,John Irving,4.23,1054,679642595,HarperCollins,John Irving,62204106,1

# Load

---

### Connect to local "books_db" database, and check for tables

In [14]:
#Connect to local database
rds_connection_string = "postgres:postgres@localhost:5432/books_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [15]:
#Check for tables
engine.table_names()

['good_reads', 'new_york_times']

### Loading clean pandas dataframes to local sql database

In [16]:
new_goodreads_data_df.to_sql(name='good_reads', con=engine, if_exists='append', index=False)

In [17]:
new_nytbooks_data_df.to_sql(name='new_york_times', con=engine, if_exists='append', index=False)

### Confirming the data was added to the two sql databases

In [18]:
pd.read_sql_query('select * from good_reads', con=engine).head()

,id,title,authors,average_rating,ratings_count,primary_isbn10
0,1,harry potter and the half-blood prince (harry ...,J.K. Rowling-Mary GrandPr√©,4.56,1944099,439785960
1,2,harry potter and the order of the phoenix (har...,J.K. Rowling-Mary GrandPr√©,4.49,1996446,439358078
2,3,harry potter and the sorcerer's stone (harry p...,J.K. Rowling-Mary GrandPr√©,4.47,5629932,439554934
3,4,harry potter and the chamber of secrets (harry...,J.K. Rowling,4.41,6267,439554896
4,5,harry potter and the prisoner of azkaban (harr...,J.K. Rowling-Mary GrandPr√©,4.55,2149872,043965548X

In [19]:
pd.read_sql_query('select * from new_york_times', con=engine).head()

,id,publisher,title,author,primary_isbn10,weeks_on_list
0,1,Sapphire Star Publishing,lost to you,A L Jackson,1938404505,0
1,2,Random House,conviction,Aaron Allston,345509102,1
2,3,Abbi Glines,forever too far,Abbi Glines,988301334,2
3,4,Atria,rush too far,Abbi Glines,1476775958,1
4,5,Atria,simple perfection,Abbi Glines,1476756538,1

### One last query checking the Join through the 'title'

In [20]:
query = """SELECT nyt.title, nyt.author, nyt.weeks_on_list, gr.average_rating, gr.ratings_count
                FROM new_york_times nyt, good_reads gr 
                WHERE nyt.title = gr.title;"""
pd.read_sql_query(query, con=engine).head()

,title,author,weeks_on_list,average_rating,ratings_count
0,the alchemist,Paulo Coelho,6,3.85,814
1,the alchemist,Paulo Coelho,6,3.85,1592632
2,life of pi,Yann Martel,12,3.90,4242
3,first love,James Patterson and Emily Raymond,0,3.79,5551
4,a prayer for owen meany,John Irving,1,4.23,1054

# Everything Looks A - OK üëå